<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of LibreOffice Language Pack and imports it into Munki.</string>
	<key>Identifier</key>
	<string>.recipe.munki.LibreOfficeLanguagePack</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>LibreOffice</string>
		<key>NAME</key>
		<string>LibreOffice Language Pack</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
				<string>all</string>
			</array>
			<key>description</key>
			<string>Sie können LibreOffice direkt in Ihrer Sprache verwenden. Der unten stehende Downloadlink lädt die Übersetzung der Benutzeroberfläche für Ihre Sprache herunter.

Falls noch nicht geschehen, müssen Sie zuvor das Hauptpaket weiter oben herunterladen und installieren.</string>
			<key>developer</key>
			<string>The Document Foundation</string>
			<key>display_name</key>
			<string>LibreOffice Language Pack</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>		
			<key>unattended_uninstall</key>
			<true/>		
			<key>uninstallable</key>
			<true/>
			<key>category</key>
			<string>Office</string>  
			<key>notes</key>
			<string>recipe robot</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>.recipe.download.LibreOfficeLanguagePack</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
